Repository: Edraak/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/edraak-platform.po
Languages: ar

source: Required. 30 characters or fewer. Letters, digits and @/./+/-/_ only.
ar: يرجى إدخال ٣٠ حرفاً أول أقل. يُسمح باستخدام الحروف والأرقام بالإضافة للرموز التالية: @ . + - _ فقط.

source: This value may contain only letters, numbers and @/./+/-/_ characters.
ar: يُسمح باستخدام الحروف والأرقام بالإضافة للرموز التالية: @ . + - _ فقط.

source: Enter a valid 'username' consisting of letters, numbers, spaces, underscores or hyphens.
ar: أدخل اسم مستخدم صحيح، مكوّناً من حروف وأرقام ومسافات وشرطات (- و _).

source: This account has been temporarily locked due to excessive login failures. Try again in {number} minute.
ar: لقد تم إغلاق هذا الحساب مؤقتاً بسبب عدة محاولات دخول فاشلة. يرجى المحاولة خلال {number} دقيقة.

source: Too many failed login attempts. Try again in {number} minute.
ar: لقد نفدت محاولات الدخول منك. يرجى المحاولة خلال {number} دقيقة.

source: If you're unable to find the password reset email, please check your email account's "Spam" or "Junk" folders to ensure the message was not filtered.
ar: إن لم تجد الرسالة في صندوق الوارد، فقم بتفقد صندوق بريد الرسائل المزعجة أو غير المرغوب فيها أو البريد غير الهام.

source: Registration process has timed out. Please refresh the page and start over.
ar: انتهى الوقت المخصص للتسجيل. قم بإعادة تحميل الصفحة والمحاولة مرة أخرى.

source: Invalid syntax
ar: تعبيرٌ رياضيٌ خاطئ

source: The default assumption is all the videos have sign-language enabled. This option allows the course authors to provide alternative video without sign-language subtitling.
ar: على افتراض أن جميع الفيديوهات مترجمة بلغة الإشارة. بواسطة هذا الخيار تستطيع أن تضيف فيديو بديل بدون لغة الإشارة.

source: Youtube ID for non-sign language version
ar: الرقم التعريفي للفيديو على يوتيوب - بدون لغة الإشارة

source: "{course_title}" Course Staff
ar: فريق مساق "{course_title}"

source: Annual Household Income
ar: دخلك السنوي

source: Tell us about your current financial situation. Why do you need assistance?
ar: اخبرنا عن وضعك المالي، ولم تحتاج للمساعدة؟

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
ar: أخبرنا عن أهدافك التعليمية والمهنية، وكيف ستساعدك شهادة مصدّقة في هذا المساق لتحقيق هذه الأهداف.

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
ar: أخبرنا عن خططك لهذا المساق. ما الخطوات التي ستتخذها لتساعدك في الحصول على شهادة إكمال المساق؟

source: Use between 250 and 500 words or so in your response.
ar: ليكن ردك يحتوي على ٢٥٠ إلى ٥٠٠ كلمة.

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
ar: اختر المساق الذي تود الحصول فيه على شهادة مصدّقة.

source: income in US Dollars ($)
ar: دخلك السنوي بالدولار الأمريكي ($)

source: Specify your annual household income in US Dollars.
ar: أدخل دخلك السنوي بالدولار الأمريكي.

source: I allow edX to use the information provided in this application (except for financial information) for edX marketing purposes.
ar: أوافق أن تستخدم إدراك هذا الطلب (عدا المعلومات المالية) لأغراض التسويق.

source: Invalid Email
ar: البريد الإلكتروني غير صحيح

source: Verify your email to share your Edraak certificate on Bayt.com
ar: فعّل بريدك الإلكتروني لتنشر شهادتك على بيت.كوم

source: A course of study offered by Edraak with cooperation from MITx. The learning experience has been supervised and managed by the course team.
ar: تم طرح هذا المساق من قبل إدراك تحت إشراف فريق من الأكاديميين الذين أشرفوا على تعليم وإدارة النقاش وتقييم الأجوبة والامتحانات، و ذلك بالتعاون مع معهد ماسشوستس للتكنولوجيا.

source: A course of study offered by Edraak. The learning experience has been supervised and managed by the course team.
ar: تم طرح هذا المساق من قبل إدراك وتحت إشراف فريق من الأكاديميين الذين أشرفوا على تعليم وإدارة النقاش وتقييم الأجوبة والامتحانات.

source: This is to certify that:
ar: تم منح شهادة إتمام المساق هذه إلى:

source: Successfully completed:
ar: لإتمام المساق التالي بنجاح:

source: This course is sponsored by:
ar: هذا المساق برعاية:

source: Course{new_line}Certificate{new_line}of Completion
ar: شهادة{new_line}إتمام{new_line}مساق

source: The security check has failed on the provided parameters
ar: المتغيرات المُعطاة لم تجتاز الفحص الأمني

source: Invalid {field_label} has been provided
ar: {field_label} المعطى خاطئ

source: ForUs profile cannot be created for admins and staff.
ar: لا يمكن لمشرفي وأعضاء تدريس إدراك استخدام حسابات فُرص.

source: The provided email format is invalid
ar: البريد الإلكتروني خاطئ

source: gender
ar: الجنس

source: language
ar: رمز اللغة

source: country
ar: رمز الدولة

source: level of education
ar: المستوى التعليميّ

source: The course has not yet been opened for enrollment
ar: هذا المساق لم يُفتح للتسجيل

source: Enrollment for this course has been closed
ar: بابُ التسجيل لهذا المساق مغلق

source: course id
ar: رمز المساق

source: The requested course does not exist
ar: المساق المطلوب غير متوفر

source: birth year
ar: تاريخ الميلاد

source: future date has been provided
ar: تاريخ ارسال الطلب غير صحيح

source: Request has expired
ar: انتهت صلاحية الطلب

source: date format
ar: شكل التاريخ

source: date forus profile created
ar: تاريخ التسجيل بواسطة بوابة فُرص.

source: {username} got tracked for {course_id}
ar: {username} سجل في مساق {course_id}

source: {course_id} course confirmation code
ar: رمز تسجيل {course_id}

source: You're receiving this e-mail because you requested a password reset for your user account at %(platform_name)s.
ar: لقد وصلك هذا البريد الإلكتروني ﻷنك طلبت إعادة ضبط كلمة المرور الخاصة بك على %(platform_name)s.

source: The name field must be at least {} characters long.
ar: يجب أن يحتوي حقل الاسم الكامل من {} حرف على الأقل.

source: This field is required.
ar: هذا الحقل مطلوب.

source: Please enter your Email.
ar: يُرجى إدخال البريد الإلكتروني.

source: Please enter your password.
ar: أدخل كلمة المرور.

source: Please enter your Full name.
ar: يُرجى إدخال الاسم الكامل.

source: Please enter your Username.
ar: يُرجى إدخال اسم المستخدم.

source: Please enter your Password.
ar: يُرجى إدخال كلمة المرور.

source: Please enter your Year of birth.
ar: يُرجى إدخال سنة الميلاد.

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
ar: يجب أن تحدد مؤسسة هذا المساق قبل أن تتابع. المؤسسة التي اخترتها غير موجودة. في حالة كون هذه المؤسسة جديدة، فإنه يتوجب عيك إضافتها.

source: Become eligible for academic credit and highlight your new skills and knowledge with a verified certificate. Use this valuable credential to qualify for academic credit, advance your career, or strengthen your school applications.
ar: أحصل على شهادة أكاديمية مصدّقة لتبين فيها خبراتك ومهاراتك الجديدة. استخدم هذه الشهادة لتعادل فيها دروساً جامعية أو تترقى في وظيفتك، أو لتدعم فيها طلب تقديمك الجامعي.

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums.
ar: سجل كمستمع في هذا المساق مجاناً، ليمكنك بذلك الاطلاع على كافة محاضرات، ومسائل وحوارات المساق.

source: Audit This Course (No Certificate)
ar: سجل كمستمع (بدون شهادة)

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums. {b_start}Please note that this track does not offer a certificate for learners who earn a passing grade.{b_end}
ar: سجل كمستمع في هذا المساق مجاناً. يمكنك بذلك مشاهدة كافة المحاضرات، ومسائل وحوارات المساق. {b_start}يرجى العلم بأن المستمعين لا يحصلون على شهادة إتمام للمساق ولو حصلوا على علامة النجاح.{b_end}

source: Bayt.com Account Activation
ar: تفعيل حسابك على بيت.كوم

source: Bayt.com Account not Found
ar: لم يتم العثور على حسابك في بيت.كوم

source: Your certificate has been posted to Bayt successfully. You well redirect to Edraak in 5 seconds. If not click {link_start}here{link_end}
ar: لقد تم نشر شهادتك على BAYT بنجاح ,سوف تعود الى إدراك خلال 5 ثوانٍ, إن لم يحدث ذلك انقر {link_start}هنا{link_end}

source: You don't have a Bayt.com with the email you've entered yet. To register a new Bayt.com account, please click {link_start}here{link_end}.
ar: لا يوجد حساب على بيت.كوم بالبريد الالكتروني الذي أدخلته. لتسجيل حساب على بيت.كوم اضغط {link_start}هنا{link_end}.

source: Verification Email has been Sent
ar: تم إرسال رسالة التفعيل

source: Your verification email has been sent. Please check your email's inbox (and sometimes spam) for the address '{email}', and click the activation link.
ar: تم إرسال رسالة التفعيل. يرجى الضغط على رابط التفعيل الموجود في الرسالة في صندوق بريد '{email}'. إن لم تجد الرسالة في صندوق الوارد، فابحث في صندوق الرسائل المهملة (أو Spam).

source: Time
ar: الوقت

source: time
ar: الوقت

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select <b>Request Credit</b> to get started.
ar: شكراً لك. لمعادلة المساق مع مساق جامعي، يجب أن تطلب ذلك من خلال موقع {link_to_provider_site} واختر <b>طلب معادلة مساق</b> للبدء بذلك.

source: Request Credit
ar: اطلب معادلة شهادتك بمساق جامعي

source: Issue Certificate
ar: أصدر الشهادة

source: Please wait...
ar: الرجاء الانتظار

source: You have Not completed this course
ar: لم تكمل هذا المساق بنجاح بعد

source: Unfortunately, you have not completed this course, you will not be able to issue a certificate.
ar: نعتذر، لن تتمكن من إصدار الشهادة لعدم إتمامك هذا المساق بنجاح.

source: You will be redirected to your {link_start}dashboard{link_end} in 10 seconds.
ar: سيتم اعادة توجيهك إلى {link_start}لوحة المعلومات{link_end} الخاصة بك بعد 10 ثوان.

source: We are calculating your grades. This may take up-to one minute.
ar: يتم حالياً حساب علامتك، قد تستمر هذه العملية ما يقارب الدقيقة.

source: Course Completion Certificate
ar: شهادة إكمال المساق

source: Please note that the certificate will be issued with your full name on it as provided on your {link_start}account settings{link_end}.
ar: نرجو ملاحظة أن الشهادة أصدرت باستخدام اسمك الكامل كما هو مكتوب في صفحة {link_start}إعدادات الحساب{link_end}.

source: Please double check your name. We prefer that the name is written in the same language you're issuing the certificate with. To change it, go to the {link_start}account settings{link_end} and edit your full name.
ar: تأكد من أن اسمك مكتوب بشكل صحيح وبنفس لغة إصدار الشهادة. لتعديل اسمك يرجى التوجه الى {link_start}إعدادات الحساب{link_end} وتعديل اسمك.

source: Download as PDF
ar: حمل بصيغة PDF

source: Already posted to Bayt.com
ar: منشور على بيت.كوم

source: Post to Bayt.com
ar: نشر على بيت.كوم

source: Do you want to post your certificate on Bayt?
ar: هل تريد أن تنشر شهادتك على بيت.كوم؟

source: Enter or Confirm your Bayt email
ar: يرجى تأكيد بريدك الإكتروني المسجل على بيت.كوم

source: This will post the course completed on your Bayt CV.
ar: سيتم إضافة هذه الشهادة إلى سيرتك الذاتية في بيت.

source: Bayt Email
ar: البريد الإلكتروني

source: Post
ar: نشر

source: An error have occurred while trying to use your account on {forus_link}.
ar: حدث خطأ أثناء محاولة استخدام حسابك على {forus_link}.

source: ForUs portal
ar: بوابة فُرص

source: Please go to {forus_link}, and try again. If the problem persists, please email us at {email}.
ar: الرجاء الرجوع إلى {forus_link} والمحاولة مجدداً. إذا ظهرت المشكلة مرة أخرى، تواصل معنا على {email}.

source: Thank you for posting your certificate on Bayt.com To proceed in process please click on the link below
ar: لإتمام عملية نشر شهادتك على بيت.كوم انقر على رابط التفعيل في الأسفل

source: Financial Assistance Application
ar: طلب منحة مساقات إدراك التعليمية

source: A Note to Learners
ar: ملاحظة للمتعلمين

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
ar: برنامج منحة مساقات إدراك التعليمية، هو برنامج صُمِّم ليعطي المتعلمين ذوي الظروف المالية الصعبة فرصة في الحصول على شهادة مصدّقة لمساقات إدراك.

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
ar: إن كنت مهتماً بالحصول على شهادة مصدقة ولا تستطيع تحمل تكاليفها، يمكنك تقديم طلب منحة تعليمية لهذا المساق. يرجى العلم بأن المقاعد محدودة ولذلك قد لا يتم الموافقة على جميع الطلبات المستحقة.

source: In order to be eligible for edX Financial Assistance, you must demonstrate that paying the Verified Certificate fee would cause you economic hardship. To apply, you will be asked to answer a few questions about why you are applying and how the Verified Certificate will benefit you.
ar: للحصول على منحة إدراك التعليمية، يجب أن تبين الصعوبة التي ستواجهها في حال أردت أن تدفع للحصول على شهادة موثقة. لتقديم الطلب، عليك الإجابة على بعض الاسئلة عنك وعن فائدة الشهادة المصدّقة لك.

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
ar: إن تمت الموافقة على طلبك، سنرسل لك تعليمات بكيفية تأكيد هويتك على إدراك كي تستطيع إكمال المساق.

source: Back to Student FAQs
ar: عُد إلى الأسئلة الشائعة

source: Apply for Financial Assistance
ar: اطلب منحة تعليمية

source: Just one more step to start learning with us!
ar: بقيت خطوة واحدة لإنشاء حسابك!

source: To activate your account, please click the link in the activation email which has been sent to {email}.
ar: تفقد بريدك الإلكتروني {email} لتفعيل حسابك عبر الضغط على رابط التفعيل الذي ستجده في رسالة تحت اسم "فعِّل حسابك على إدراك".

source: If you're unable to find the activation email, please check your email account's "Spam" or "Junk" folders to ensure the message was not filtered.
ar: إن لم تجد الرسالة في الصندوق الوارد، تفقد الرسائل المزعجة/غير المرغوب فيها أو البريد غير الهام.

source: Password reset on {platform_name}
ar: تعليمات تغيير كلمة المرور على {platform_name}

source: Note: The organization name is part of the course URL
ar: ملاحظة: اسم المؤسسة سيكون جزءاً من رابط المساق (URL)
