Repository: Edraak/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/edraak-platform-theme.po
Languages: ar

source: Enter a valid 'username' consisting of letters, numbers, spaces, underscores or hyphens.
ar: أدخل اسم مستخدم صحيح، متكوّن من الحروف والأرقام والمسافات والشرطات (- و _).

source: A course of study offered by Edraak with cooperation from MITx. The learning experience has been supervised and managed by the course team.
ar: تم طرح هذا المساق من قبل إدراك تحت إشراف فريق من الأكاديمين الذين اشرفوا على تعليم وإدارة النقاش وتقييم الأجوبة والإمتحانات، و ذلك بالتعاون مع معهد ماسشوستس للتكنولوجيا.

source: A course of study offered by Edraak. The learning experience has been supervised and managed by the course team.
ar: تم طرح هذا المساق من قبل إدراك وتحت إشراف فريق من الأكاديمين الذين اشرفوا على تعليم وإدارة النقاش وتقييم الأجوبة والإمتحانات.

source: This is to certify that:
ar: تم منح شهادة إتمام المساق هذﮦ إلى:

source: Successfully completed:
ar: لإتمام المساق التالي بنجاح:

source: Course{new_line}Certificate{new_line}of Completion
ar: شهادة{new_line}إتمام{new_line}مساق

source: Edraak
ar: إدراك

source: Password reset on %(site_name)s
ar: تعليمات تغيير كلمة المرور على %(site_name)s

source: You're receiving this e-mail because you requested a password reset for your user account at edraak.org.
ar: تم إرسال هذا البريد الإلكتروني لك بناءً على طلبك لتغيير كلمة المرور الخاصة بك على موقع edraak.org.

source: The Edraak Team
ar: فريق عمل إدراك

source: Welcome, {username}!
ar: مرحباً، {username}!

source: You're one step away from accessing {course_name} course.
ar: أنت على بعد خطوة واحدة من الوصول إلى مساق {course_name}.

source: You're creating a new {platform_name} account using ForUs.
ar: أنت تقوم بإنشاء حساباً جديداً على {platform_name}، باستخدام موقع فُرص.

source: Your {platform_name} profile will be created using the same registration information used for your profile/account on ForUs. To access the course, please fill out the following form.
ar: سيتم استخدام نفس المعلومات التي سجلت بها على موقع فُرص. لإنشاء حسابك على {platform_name}. للوصول إلى المساق، يُرجى إكمال النموذج التالي.

source: Please let us know why you're interested in {platform_name}'s courses.
ar: يُرجى إخبارنا عن سبب اهتمامك بمساقات {platform_name}.

source: HMAC is incorrect
ar: رمز الحماية خاطئ

source: HMAC is missing
ar: رمز الحماية غير موجود

source: ForUs profile cannot be created for admins and staff.
ar: لا يمكن لمشرفي وأعضاء تدريس إدراك استخدام حسابات فُرص.

source: Email or password is incorrect. You can request a new password, or you can use your ForUs account to login to {platform_name} directly.
ar: البريد الإلكتروني أو كلمة السر غير صحيحة. يمكنك طلب كلمة سر جديدة، أو الذهاب إلى حسابك في موقع فُرص للدخول إلى {platform_name} مباشرةً.

source: Link
ar: اربط

source: Unlink
ar: افصل

source: Hi!
ar: مرحبا!

source: If you are an enrolled student and have any questions, feedback, bug reports, suggestions, or any other issues specific to a particular class, please post on the discussion forums of that class.
ar: إذا كنت منتسب إلى إحدى مساقات إدراك ولديك أي أسئلة، أو أي اقتراحات، أو أي مشاكل تقنية, أو أي قضايا أخرى تخص مساق معين، الرجاء نشر ذلك على منتديات المناقشة الخاصة بذلك المساق.

source: Still need help or want to give us general feedback (which we welcome)? Please fill in the form below
ar: لا تزال بحاجة إلى مساعدة أو تريد أن تزودنا باقترحات عامة (التي نرحب بها دائما)، الرجاء تعبئة النموذج أدناه.

source: You have entered a wrong captcha. Your message was not sent.
ar: الرجاء إدخال كابتشا صحيحة

source: All fields That end with an asterisk (*) are required.
ar: جميع الحقول التي تنتهي بعلامة النجمة (*) مطلوبة.

source: Your message has been sent. Thank you!
ar: تم إرسال رسالتك. شكرا لك!

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: E-mail
ar: البريد الإلكتروني

source: Inquiry Type
ar: سبب الاتصال

source: Please select
ar: يرجى الاختيار

source: Question About Registration and Activation
ar: سؤال متعلق بالاشتراك والتفعيل

source: Question About Certification and Exams
ar: سؤال متعلق بالشهادة أو الإمتحانات

source: Suggest a Course
ar: اقتراح مساق

source: Submit a CV
ar: تقديم السيرة الذاتية

source: Collaboration Opportunity
ar: الرغبة في التعاون

source: Other
ar: أخرى

source: Message
ar: الرسالة

source: Your message here...
ar: أدخل رسالتك هنا...

source: Send Now
ar: أرسل الأن

source: We are always looking for new opportunities of collaboration. Please fill in the form below, so we can learn more about your interests. We look forward to hearing from you!
ar: نحن نبحث دائما عن فرص جديدة للتعاون. يرجى ملء النموذج أدناه، حتى نتمكن من معرفة المزيد عن اهتماماتك.

source: I am a...
ar: أنا…

source: Professor
ar: أستاذ

source: Practitioner
ar: صاحب مهنة

source: Educational Institution
ar: مؤسسة تعليمية

source: Non-governmental Organization
ar: منظمة غير حكومية

source: Company
ar: شركة

source: I am Interested in...
ar: أنا مهتم بـ ...

source: Creating a MOOC
ar: إنشاء مساق

source: Teaching a MOOC as an assistant instructor
ar: تدريس مساق كمدرس مساعد

source: Sponsoring a MOOC
ar: رعاية مساق

source: Supporting Edraak as a partner
ar: دعم إدراك كشريك

source: Affiliated Institution/Organization
ar: المؤسسة ذات العلاقة

source: Institution or Organization's Website
ar: موقع المؤسسة

source: Discipline/Department/Field of Expertise
ar: القسم/ مجال التخصص

source: Course title or topic
ar: عنوان أو الموضوع المساق

source: Country
ar: الدولة

source: Send Message
ar: أرسل الرسالة
